<?php

require('vendor/autoload.php');

use ren1244\PDFWriter\PDFWriter;

$text = <<<EOT
詩曰：
混沌未分天地亂，茫茫渺渺無人見。
自從盤古破鴻濛，開闢從茲清濁辨。
覆載群生仰至仁，發明萬物皆成善。
欲知造化會元功，須看西遊釋厄傳。

　　蓋聞天地之數，有十二萬九千六百歲為一元。將一元分為十二會，乃子、丑、寅、卯、辰、巳、午、未、申、酉、戌、亥之十二支也。每會該一萬八百歲。且就一日而論：子時得陽氣，而丑則雞鳴；寅不通光，而卯則日出；辰時食後，而巳則挨排；日午天中，而未則西蹉；申時晡，而日落酉，戌黃昏，而入定亥。譬於大數，若到戌會之終，則天地昏曚而萬物否矣。再去五千四百歲，交亥會之初，則當黑暗，而兩間人物俱無矣，故曰混沌。又五千四百歲，亥會將終，貞下起元，近子之會，而復逐漸開明。邵康節曰：「冬至子之半，天心無改移。一陽初動處，萬物未生時。」到此，天始有根。再五千四百歲，正當子會，輕清上騰，有日，有月，有星，有辰。日、月、星、辰，謂之四象。故曰，天開於子。又經五千四百歲，子會將終，近丑之會，而逐漸堅實。《易》曰：「大哉乾元！至哉坤元！萬物資生，乃順承天。」至此，地始凝結。再五千四百歲，正當丑會，重濁下凝，有水，有火，有山，有石，有土。水、火、山、石、土，謂之五形。故曰，地闢於丑。又經五千四百歲，丑會終而寅會之初，發生萬物。曆曰：「天氣下降，地氣上升；天地交合，群物皆生。」至此，天清地爽，陰陽交合。再五千四百歲，正當寅會，生人，生獸，生禽，正謂天地人，三才定位。故曰，人生於寅。
　　感盤古開闢，三皇治世，五帝定倫，世界之間，遂分為四大部洲：曰東勝神洲，曰西牛賀洲，曰南贍部洲，曰北俱蘆洲。這部書單表東勝神洲。海外有一國土，名曰傲來國。國近大海，海中有一座名山，喚為花果山。此山乃十洲之祖脈，三島之來龍，自開清濁而立，鴻濛判後而成。真個好山！有詞賦為證。賦曰：
勢鎮汪洋，威寧瑤海。勢鎮汪洋，潮湧銀山魚入穴；威寧瑤海，波翻雪浪蜃離淵。水火方隅高積上，東海之處聳崇巔。丹崖怪石，削壁奇峰。丹崖上，彩鳳雙鳴；削壁前，麒麟獨臥。峰頭時聽錦雞鳴，石窟每觀龍出入。林中有壽鹿仙狐，樹上有靈禽玄鶴。瑤草奇花不謝，青松翠柏長春。仙桃常結果，修竹每留雲。一條澗壑籐蘿密，四面原堤草色新。正是百川會處擎天柱，萬劫無移大地根。
EOT;

$pdf = new PDFWriter();
$pdf->font->addFont('kaiTW98', true);

// 標題
$pdf->font->setFont('kaiTW98', 18);
$pdf->addPage('A5H');
$pdf->text->setRect(190, 10, 10, 128);
$pdf->text->addTextV('西遊記', [
    'wordSpace' => 12,
    'lineSpace' => 0,
]);

$pdf->font->setFont('kaiTW98', 14);

// 內文第一頁
$pdf->text->setRect(10, 10, 180, 128);
$text = $pdf->text->addTextV($text, [
    'wordSpace' => 2,
    'lineSpace' => 3
]);

// 如果還沒寫完，下一頁繼續寫
while ($text) {
    $pdf->addPage('A5H');
    $pdf->text->setRect(10, 10, 190, 128);
    $text = $pdf->text->addTextV($text, [
        'wordSpace' => 2,
        'lineSpace' => 3
    ]);
}

// 輸出
header('Content-Disposition: inline; filename="直書範例-西遊記.pdf"');
$pdf->output();
